app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "description", "picture_file_name", "summary", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @project = Project.new(project_params)
    # @project.category = params[:category][:id]

    respond_to do |format|
      if @project.save